jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F4xx_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="file:/C:/Users/1/AppData/Local/Arm/Packs/ARM/CMSIS/5.6.0/CMSIS/Utilities/PACK.xsd" schemaVersion="1.4">
    <vendor>Geehy</vendor>
    <name>APM32F4xx_DFP</name>
    <description>Geehy Semiconductor APM32F4 Series Device Support, Drivers and Examples</description>
    <url>https://www.geehy.com/uploads/tool/</url>
    <supportContact>https://www.geehy.com/support/apm</supportContact>
    <releases>
        
        
        
	    <release version="1.0.3" date="2023-03-08">      Update APM32F465 Devices for 1.0.3.</release><release version="1.0.2" date="2022-06-25">      Update Library for 1.0.2.</release><release version="1.0.1" date="2022-02-25">      Update Library for 1.0.1.</release><release version="1.0.0" date="2021-09-14">      First Release version of APM32F4 Device Family Pack.</release>
    </releases>
    <keywords>
        <!-- keywords for indexing -->
        <keyword>Geehy</keyword>
        <keyword>Device Support</keyword>
        <keyword>Device Family Package Geehy Semiconductor</keyword>
        <keyword>APM32F4</keyword>
        <keyword>APM32</keyword>
    </keywords>
    <devices>
        <family Dfamily="APM32F4 Series" Dvendor="Geehy:163">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
            <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
            <description>
The APM32F4 family incorporates high-speed embedded memories and an extensive range of enhanced I/Os and peripherals connected to two APB buses, three AHB buses and a 32-bit multi-AHB bus matrix.
- 64-Kbyte of CCM (core coupled memory) data RAM
- FPU floating-point processing unit
- Timer with quadrature (incremental) encoder input
- Parallel camera interface
- True random number generator
- RTC: subsecond accuracy, hardware calendar
- 96-bit unique ID</description>
            <feature type="WDT" n="2"/>
            <feature type="RTC" n="32768"/>
            <feature type="CAN" n="2"/>
            <feature type="USBD" n="2"/>
            <feature type="VCC" n="2.00" m="3.60"/>
            <feature type="Temp" n="-40" m="85"/>
            <feature type="Temp" n="-40" m="105"/>
            <!-- ************************  Subfamily 'APM32F405'  **************************** -->
            <subFamily DsubFamily="APM32F405">
                <processor Dclock="168000000"/>
                <debug svd="SVD/APM32F40x.svd"/>
                <book name="Documents/DATASHEET.pdf" title="APM32F4"/>
                <feature type="Timer" n="12" m="16"/>
                <feature type="DAC" n="2" m="12"/>
                <feature type="SPI" n="3" m="37500000"/>
                <feature type="USART" n="4" m="10500000"/>
                <feature type="UART" n="2" m="10500000"/>
                <feature type="USBOTG" n="3"/>
                <feature type="CAN" n="2"/>
                <feature type="SDIO" n="1" m="8" name="Secure Digital IO"/>
                <feature type="ETH" n="1" m="100000000"/>
                <feature type="VCC" n="1.80" m="3.60"/>
                <feature type="Camera" n="1" m="14"/>
                <!-- *************************  Device 'APM32F405RG'  ***************************** -->
                <device Dname="APM32F405RG">
                    <memory id="IROM1" start="0x08000000" size="0x00100000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F4xx_1024.FLM" start="0x08000000" size="0x00100000" default="1"/>
                    <algorithm name="Flash/APM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="51"/>
                    <feature type="ADC" n="16" m="12"/>
                </device>
                <!-- *************************  Device 'APM32F405VG'  ***************************** -->
                <device Dname="APM32F405VG">
                    <memory id="IROM1" start="0x08000000" size="0x00100000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F4xx_1024.FLM" start="0x08000000" size="0x00100000" default="1"/>
                    <algorithm name="Flash/APM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="82"/>
                    <feature type="ADC" n="16" m="12"/>
                </device>
                <!-- *************************  Device 'APM32F405ZG'  ***************************** -->
                <device Dname="APM32F405ZG">
                    <memory id="IROM1" start="0x08000000" size="0x00100000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F4xx_1024.FLM" start="0x08000000" size="0x00100000" default="1"/>
                    <algorithm name="Flash/APM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="114"/>
                    <feature type="ADC" n="24" m="12"/>
                </device>
            </subFamily>
            <!-- ************************  Subfamily 'APM32F407'  **************************** -->
            <subFamily DsubFamily="APM32F407">
                <processor Dclock="168000000"/>
                <debug svd="SVD/APM32F40x.svd"/>
                <book name="Documents/DATASHEET.pdf" title="APM32F4"/>
                <feature type="Timer" n="12" m="16"/>
                <feature type="DAC" n="2" m="12"/>
                <feature type="SPI" n="3" m="37500000"/>
                <feature type="USART" n="4" m="10500000"/>
                <feature type="UART" n="2" m="10500000"/>
                <feature type="USBOTG" n="3"/>
                <feature type="CAN" n="2"/>
                <feature type="SDIO" n="1" m="8" name="Secure Digital IO"/>
                <feature type="ETH" n="1" m="100000000"/>
                <feature type="VCC" n="1.80" m="3.60"/>
                <feature type="Camera" n="1" m="14"/>
                <!-- *************************  Device 'APM32F407RE'  ***************************** -->
                <device Dname="APM32F407RE">
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F4xx_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <algorithm name="Flash/APM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="51"/>
                    <feature type="ADC" n="16" m="12"/>
                </device>
                <!-- *************************  Device 'APM32F407VE'  ***************************** -->
                <device Dname="APM32F407VE">
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F4xx_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <algorithm name="Flash/APM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="82"/>
                    <feature type="ADC" n="16" m="12"/>
                </device>
                <!-- *************************  Device 'APM32F407ZE'  ***************************** -->
                <device Dname="APM32F407ZE">
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F4xx_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <algorithm name="Flash/APM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="114"/>
                    <feature type="ADC" n="24" m="12"/>
                </device>
