jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F4xx_DFP.pdsc
                <!-- *************************  Device 'APM32F415ZG'  ***************************** -->
                <device Dname="APM32F415ZG">
                    <memory id="IROM1" start="0x08000000" size="0x00100000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F4xx_1024.FLM" start="0x08000000" size="0x00100000" default="1"/>
                    <algorithm name="Flash/APM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="114"/>
                    <feature type="ADC" n="24" m="12"/>
                </device>
            </subFamily>
            <!-- ************************  Subfamily 'APM32F417'  **************************** -->
            <subFamily DsubFamily="APM32F417">
                <processor Dclock="168000000"/>
                <debug svd="SVD/APM32F41x.svd"/>
                <book name="Documents/DATASHEET.pdf" title="APM32F4"/>
                <feature type="Timer" n="12" m="16"/>
                <feature type="DAC" n="2" m="12"/>
                <feature type="SPI" n="3" m="37500000"/>
                <feature type="USART" n="4" m="10500000"/>
                <feature type="UART" n="2" m="10500000"/>
                <feature type="USBOTG" n="3"/>
                <feature type="CAN" n="2"/>
                <feature type="SDIO" n="1" m="8" name="Secure Digital IO"/>
                <feature type="ETH" n="1" m="100000000"/>
                <feature type="VCC" n="1.80" m="3.60"/>
                <feature type="Camera" n="1" m="14"/>
                <!-- *************************  Device 'APM32F417VE'  ***************************** -->
                <device Dname="APM32F417VE">
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F4xx_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <algorithm name="Flash/APM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="82"/>
                    <feature type="ADC" n="16" m="12"/>
                </device>
                <!-- *************************  Device 'APM32F417ZE'  ***************************** -->
                <device Dname="APM32F417ZE">
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F4xx_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <algorithm name="Flash/APM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="114"/>
                    <feature type="ADC" n="24" m="12"/>
                </device>
                <!-- *************************  Device 'APM32F417IE'  ***************************** -->
                <device Dname="APM32F417IE">
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F4xx_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <algorithm name="Flash/APM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="140"/>
                    <feature type="ADC" n="24" m="12"/>
                </device>
                <!-- *************************  Device 'APM32F417VG'  ***************************** -->
                <device Dname="APM32F417VG">
                    <memory id="IROM1" start="0x08000000" size="0x00100000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F4xx_1024.FLM" start="0x08000000" size="0x00100000" default="1"/>
                    <algorithm name="Flash/APM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="82"/>
                    <feature type="ADC" n="16" m="12"/>
                </device>
                <!-- *************************  Device 'APM32F417ZG'  ***************************** -->
                <device Dname="APM32F417ZG">
                    <memory id="IROM1" start="0x08000000" size="0x00100000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F4xx_1024.FLM" start="0x08000000" size="0x00100000" default="1"/>
                    <algorithm name="Flash/APM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="114"/>
                    <feature type="ADC" n="24" m="12"/>
                </device>
