jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F4xx_DFP.pdsc
                <!-- *************************  Device 'APM32F417IG'  ***************************** -->
                <device Dname="APM32F417IG">
                    <memory id="IROM1" start="0x08000000" size="0x00100000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F4xx_1024.FLM" start="0x08000000" size="0x00100000" default="1"/>
                    <algorithm name="Flash/APM32F40xxx_41xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="140"/>
                    <feature type="ADC" n="24" m="12"/>
                </device>
            </subFamily><!-- ************************  Subfamily 'APM32F465'  **************************** --><subFamily DsubFamily="APM32F465">
                <processor Dclock="168000000"/>
                <debug svd="SVD/APM32F465.svd"/>
                <book name="Documents/DATASHEET.pdf" title="APM32F465"/>
                <feature type="Timer" n="12" m="16"/>
                <feature type="DAC" n="2" m="12"/>
                <feature type="SPI" n="3" m="37500000"/>
                <feature type="USART" n="4" m="10500000"/>
                <feature type="UART" n="2" m="10500000"/>
                <feature type="USBOTG" n="3"/>
                <feature type="CAN" n="2"/>
                <feature type="SDIO" n="1" m="8" name="Secure Digital IO"/>
                <feature type="VCC" n="1.80" m="3.60"/>
                <feature type="Camera" n="1" m="14"/>
                <!-- *************************  Device 'APM32F465VE'  ***************************** -->
                <device Dname="APM32F465VE">
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F465_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <algorithm name="Flash/APM32F465xx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F465_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="82"/>
                    <feature type="ADC" n="16" m="12"/>
                </device>
                <!-- *************************  Device 'APM32F465RE'  ***************************** -->
                <device Dname="APM32F465RE">
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32F465_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <algorithm name="Flash/APM32F465xx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32F465_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="51"/>
                    <feature type="ADC" n="16" m="12"/>
                </device>
            </subFamily>
        </family>
    </devices>
   
    <!--APM32F4xx conditions--><conditions>
        <!-- conditions selecting Compiler -->
        <condition id="Compiler ARMCC">
            <require Tcompiler="ARMCC"/>
        </condition>	
    
        <!--APM32F405xx Device Conditions-->
        <condition id="APM32F405xx">
            <description>Geehy Semiconductor APM32F405xx Series devices</description>
            <require Dvendor="Geehy:163" Dname="APM32F405*"/>
        </condition>
          
        <!--APM32F407xx Device Conditions-->
        <condition id="APM32F407xx">
            <description>Geehy Semiconductor APM32F407xx Series devices</description>
            <require Dvendor="Geehy:163" Dname="APM32F407*"/>
        </condition>
   
        <!--APM32F415xx Device Conditions-->
        <condition id="APM32F415xx">
            <description>Geehy Semiconductor APM32F415xx Series devices</description>
            <require Dvendor="Geehy:163" Dname="APM32F415*"/>
        </condition>
 
        <!--APM32F417xx Device Conditions-->
        <condition id="APM32F417xx">
            <description>Geehy Semiconductor APM32F417xx Series devices</description>
            <require Dvendor="Geehy:163" Dname="APM32F417*"/>
        </condition><!--APM32F465xx Device Conditions--><condition id="APM32F465xx">
            <description>Geehy Semiconductor APM32F465xx Series devices</description>
            <require Dvendor="Geehy:163" Dname="APM32F465*"/>
        </condition>
 
        <!--APM32F40x ARMCC Conditions -->
        <condition id="APM32F40x ARMCC">
            <description>filter for APM32F40x Device and the ARM compiler</description>
            <accept condition="APM32F405xx"/>
            <accept condition="APM32F407xx"/>
            <require Tcompiler="ARMCC"/>    
        </condition>
        
        <!--APM32F41x ARMCC Conditions -->
        <condition id="APM32F41x ARMCC">
            <description>filter for APM32F41x Device and the ARM compiler</description>
            <accept condition="APM32F415xx"/>
            <accept condition="APM32F417xx"/>
            <require Tcompiler="ARMCC"/>
        </condition><!--APM32F465 ARMCC Conditions --><condition id="APM32F465xx ARMCC">
            <description>filter for APM32F465 Device and the ARM compiler</description>
            
            
            <require condition="APM32F465xx"/><require Tcompiler="ARMCC"/>
        </condition>
        
