jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F4xx_DFP.pdsc
        <!--APM32F4xx CMSIS Conditions -->
        <condition id="APM32F4xx CMSIS">
            <description>Geehy Semiconductor APM32F4xx Device with CMSIS</description>
            <accept condition="APM32F405xx"/>
	        <accept condition="APM32F407xx"/>
            <accept condition="APM32F415xx"/>
            <accept condition="APM32F417xx"/>
            <require Cclass="CMSIS" Cgroup="CORE"/>
        </condition><!--APM32F465xx CMSIS Conditions --><condition id="APM32F465xx CMSIS">
            <description>Geehy Semiconductor APM32F465 Device with CMSIS</description>
            
	        
            
            
            <require condition="APM32F465xx"/><require Cclass="CMSIS" Cgroup="CORE"/>
        </condition>
        
        <!--APM32F4xx STDPERIPH Conditions -->
        <condition id="APM32F4xx STDPERIPH">
            <description>Geehy Semiconductor APM32F4xx with Standard Peripherals Drivers Framework</description>
            <require condition="APM32F4xx CMSIS"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
        </condition><!--APM32F465xx STDPERIPH Conditions --><condition id="APM32F465xx STDPERIPH">
            <description>Geehy Semiconductor APM32F465 with Standard Peripherals Drivers Framework</description>
            
            <require condition="APM32F465xx CMSIS"/><require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
        </condition>
        
        <!--APM32F4xx STDPERIPH RCM Conditions-->
        <condition id="APM32F4xx STDPERIPH RCM">
            <description>Geehy Semiconductor APM32F4xx with Standard Peripherals Drivers Framework and RCM</description>
            <require condition="APM32F4xx CMSIS"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM"/>
        </condition><!--APM32F465xx STDPERIPH RCM Conditions--><condition id="APM32F465xx STDPERIPH RCM">
            <description>Geehy Semiconductor APM32F465 with Standard Peripherals Drivers Framework and RCM</description>
            
            
            <require condition="APM32F465xx CMSIS"/><require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/><require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM"/>
        </condition>
    </conditions>
      
    <!-- Standard Peripherals Drivers-->
    <components>
        <!--APM32F4xx-->
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.2" condition="APM32F4xx CMSIS">
            <description>System Startup for Geehy Semiconductor APM32F4xx device series</description>
            <files>
                <!--  include folder -->
                <file category="include" name="Device/CMSIS/Include/"/>
                <file category="include" name="Device/Device/Geehy/APM32F4xx/Include/"/>
                <!-- startup files -->
                <file category="source" name="Device/Device/Geehy/APM32F4xx/Source/arm/startup_apm32f40x.s" attr="config" version="1.0.2" condition="APM32F40x ARMCC"/>
                <file category="source" name="Device/Device/Geehy/APM32F4xx/Source/arm/startup_apm32f41x.s" attr="config" version="1.0.2" condition="APM32F41x ARMCC"/>
                <!-- system file -->
                <file category="source" name="Device/Device/Geehy/APM32F4xx/Source/system_apm32f4xx.c" attr="config" version="1.0.2"/>
                <!-- device configuration required by drivers at the moment -->
            </files>
        </component>
        
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="1.0.2" condition="APM32F4xx STDPERIPH">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FRAMEWORK</RTE_Components_h>
            <files>
                <file category="include" name="Device/APM32F4xx_StdPeriphDriver/inc/"/>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_misc.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_misc.c"/>
                <file category="header" name="Device/Templates/apm32f4xx_int.h" attr="template" select="Interrupt Service Routines"/>
                <file category="source" name="Device/Templates/apm32f4xx_int.c" attr="template" select="Interrupt Service Routines"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>Analog-to-digital converter (ADC) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_ADC </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_adc.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_adc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>Controller area network (CAN) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CAN      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_can.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_can.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="1.0.2" condition="APM32F4xx STDPERIPH">
            <description>CRC calculation unit (CRC) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CRC      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_crc.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_crc.c"/>
            </files>
        </component>
