jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F4xx_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRYP" Cversion="1.0.2" condition="APM32F4xx STDPERIPH">
            <description>Cryptographic processor (CRYP) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CRYP      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_cryp.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_cryp.c"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_cryp_aes.c"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_cryp_des.c"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_cryp_tdes.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC" Cversion="1.0.3" condition="APM32F4xx STDPERIPH RCM">
            <description>Digital-to-analog converter (DAC) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DAC     </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_dac.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_dac.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DBGMCU" Cversion="1.0.2" condition="APM32F4xx STDPERIPH">
            <description>MCU debug component (DBGMCU) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DBGMCU</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_dbgmcu.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_dbgmcu.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DCI" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>Digital camera interface (DCI) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DCI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_dci.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_dci.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>DMA controller (DMA) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DMA      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_dma.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_dma.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMC" Cversion="1.0.2" condition="APM32F4xx STDPERIPH">
            <description>SDRC driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SDRC</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_dmc.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_dmc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EINT" Cversion="1.0.2" condition="APM32F4xx STDPERIPH">
            <description>External interrupt/event controller (EINT) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_EINT </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_eint.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_eint.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FMC" Cversion="1.0.2" condition="APM32F4xx STDPERIPH">
            <description>Flash memory controller driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FMC     </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_fmc.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_fmc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>General-purpose I/O (GPIO) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_GPIO      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_gpio.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_gpio.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="HASH" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>Hash processor (HASH) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_HASH      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_hash.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_hash.c"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_hash_md5.c"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_hash_sha1.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="I2C" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>Inter-integrated circuit (I2C) interface driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_I2C      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_i2c.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_i2c.c"/>
            </files>
        </component>
