jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F4xx_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="IWDT" Cversion="1.0.2" condition="APM32F4xx STDPERIPH">
            <description>Independent watchdog (IWDT) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_IWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_iwdt.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_iwdt.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PMU" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>Power controller (PMU) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_PMU</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_pmu.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_pmu.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM" Cversion="1.0.3" condition="APM32F4xx STDPERIPH">
            <description>Reset and clock management unit (RCM) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RCM</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_rcm.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_rcm.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RNG" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>Random number generator (RNG) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RNG</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_rng.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_rng.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC" Cversion="1.0.2" condition="APM32F4xx STDPERIPH">
            <description>Real-time clock (RTC) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RTC</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_rtc.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_rtc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>Secure digital (SDIO) interface driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SDIO</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_sdio.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_sdio.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SMC" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>SMC driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SMC</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_smc.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_smc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>Serial peripheral interface (SPI) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SPI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_spi.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_spi.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SYSCFG" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>System configuration controller (SYSCFG) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SPI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_syscfg.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_syscfg.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TMR" Cversion="1.0.3" condition="APM32F4xx STDPERIPH RCM">
            <description>Timers (TMR) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_TMR</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_tmr.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_tmr.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>Universal synchronous asynchronous receiver transmitter (USART) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_USART</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_usart.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_usart.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDT" Cversion="1.0.2" condition="APM32F4xx STDPERIPH RCM">
            <description>Window watchdog (WWDT) driver for APM32F4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_WWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F4xx_StdPeriphDriver/inc/apm32f4xx_wwdt.h"/>
                <file category="source" name="Device/APM32F4xx_StdPeriphDriver/src/apm32f4xx_wwdt.c"/>
            </files>
        </component>
        <!--APM32F465-->
    
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="APM32F465xx CMSIS">
            <description>System Startup for Geehy Semiconductor APM32F465 device series</description>
            <files>
                <!--  include folder -->
                <file category="include" name="Device/CMSIS/Include/"/>
                <file category="include" name="Device/Device/Geehy/APM32F465/Include/"/>
                <!-- startup files -->
                <file category="source" name="Device/Device/Geehy/APM32F465/Source/arm/startup_apm32f465.s" attr="config" version="1.0.0" condition="APM32F465xx ARMCC"/>
                <!-- system file -->
                <file category="source" name="Device/Device/Geehy/APM32F465/Source/system_apm32f465.c" attr="config" version="1.0.0"/>
                <!-- device configuration required by drivers at the moment -->
            </files>
        </component>
        
