jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F4xx_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="1.0.0" condition="APM32F465xx STDPERIPH">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FRAMEWORK</RTE_Components_h>
            <files>
                <file category="include" name="Device/APM32F465_StdPeriphDriver/inc/"/>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_misc.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_misc.c"/>
                <file category="header" name="Device/Templates/apm32f465_int.h" attr="template" select="Interrupt Service Routines"/>
                <file category="source" name="Device/Templates/apm32f465_int.c" attr="template" select="Interrupt Service Routines"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>Analog-to-digital converter (ADC) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_ADC </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_adc.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_adc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>Controller area network (CAN) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CAN      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_can.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_can.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="1.0.0" condition="APM32F465xx STDPERIPH">
            <description>CRC calculation unit (CRC) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CRC      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_crc.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_crc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRYP" Cversion="1.0.0" condition="APM32F465xx STDPERIPH">
            <description>Cryptographic processor (CRYP) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CRYP      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_cryp.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_cryp.c"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_cryp_aes.c"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_cryp_des.c"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_cryp_tdes.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>Digital-to-analog converter (DAC) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DAC     </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_dac.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_dac.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DBGMCU" Cversion="1.0.0" condition="APM32F465xx STDPERIPH">
            <description>MCU debug component (DBGMCU) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DBGMCU</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_dbgmcu.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_dbgmcu.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DCI" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>Digital camera interface (DCI) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DCI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_dci.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_dci.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>DMA controller (DMA) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DMA      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_dma.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_dma.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMC" Cversion="1.0.0" condition="APM32F465xx STDPERIPH">
            <description>SDRC driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SDRC</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_dmc.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_dmc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EINT" Cversion="1.0.0" condition="APM32F465xx STDPERIPH">
            <description>External interrupt/event controller (EINT) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_EINT </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_eint.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_eint.c"/>
            </files>
        </component>
