jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F4xx_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FMC" Cversion="1.0.0" condition="APM32F465xx STDPERIPH">
            <description>Flash memory controller driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FMC     </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_fmc.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_fmc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>General-purpose I/O (GPIO) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_GPIO      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_gpio.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_gpio.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="HASH" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>Hash processor (HASH) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_HASH      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_hash.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_hash.c"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_hash_md5.c"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_hash_sha1.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="I2C" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>Inter-integrated circuit (I2C) interface driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_I2C      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_i2c.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_i2c.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="IWDT" Cversion="1.0.0" condition="APM32F465xx STDPERIPH">
            <description>Independent watchdog (IWDT) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_IWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_iwdt.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_iwdt.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PMU" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>Power controller (PMU) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_PMU</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_pmu.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_pmu.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM" Cversion="1.0.0" condition="APM32F465xx STDPERIPH">
            <description>Reset and clock management unit (RCM) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RCM</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_rcm.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_rcm.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RNG" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>Random number generator (RNG) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RNG</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_rng.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_rng.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC" Cversion="1.0.0" condition="APM32F465xx STDPERIPH">
            <description>Real-time clock (RTC) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RTC</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_rtc.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_rtc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>Secure digital (SDIO) interface driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SDIO</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_sdio.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_sdio.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SMC" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>SMC driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SMC</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_smc.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_smc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>Serial peripheral interface (SPI) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SPI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_spi.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_spi.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SYSCFG" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>System configuration controller (SYSCFG) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SPI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_syscfg.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_syscfg.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TMR" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>Timers (TMR) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_TMR</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_tmr.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_tmr.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>Universal synchronous asynchronous receiver transmitter (USART) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_USART</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_usart.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_usart.c"/>
            </files>
        </component>
