jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32F4xx_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDT" Cversion="1.0.0" condition="APM32F465xx STDPERIPH RCM">
            <description>Window watchdog (WWDT) driver for APM32F465 </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_WWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32F465_StdPeriphDriver/inc/apm32f465_wwdt.h"/>
                <file category="source" name="Device/APM32F465_StdPeriphDriver/src/apm32f465_wwdt.c"/>
            </files>
        </component>
    </components>
        
    <boards><!--APM32F4xx board information-->
        <board vendor="Geehy" name="APM32F407MINI" revision="Ver 1.0">
            <description>Geehy APM32F407 Development Board</description>
            
            <mountedDevice deviceIndex="0" Dvendor="Geehy:163" Dname="APM32F407VG"/>
            <compatibleDevice deviceIndex="0" Dvendor="Geehy:163" DsubFamily="APM32F407"/>
            <feature type="XTAL" n="8000000"/>
            <feature type="PWR" n="5" name="USB Powered"/>
            <feature type="USB" n="1" name="USB 2.0 Full Speed Device"/>
            <feature type="RS232" n="1"/>
            <feature type="Button" n="2" name="Reset, KEY1 and KEY2"/>
            <feature type="LED" n="2" name="LEDs directly connected to port pins"/>
            <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
        </board><!--APM32F465 board information--><board vendor="Geehy" name="APM32F465MINI" revision="Ver 1.0">
            <description>Geehy APM32F465xx Development Board</description>
            
            <mountedDevice deviceIndex="0" Dvendor="Geehy:163" Dname="APM32F465VE"/>
            <compatibleDevice deviceIndex="0" Dvendor="Geehy:163" DsubFamily="APM32F465"/>
            <feature type="XTAL" n="8000000"/>
            <feature type="PWR" n="5" name="USB Powered"/>
            <feature type="USB" n="1" name="USB 2.0 Full Speed Device"/>
            <feature type="RS232" n="1"/>
            <feature type="Button" n="2" name="Reset, KEY1 and KEY2"/>
            <feature type="LED" n="2" name="LEDs directly connected to port pins"/>
            <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
        </board>
    </boards>
    <examples><!--APM32F4xx example information-->
        <example name="APM32F407MINI-Blinky" doc="readme.txt" folder="Boards/Geehy/APM32F407MINI/Blinky">
            <description>APM32F407_MINI  Blinky example</description>
            <board name="APM32F407MINI" vendor="Geehy"/>
            <project>
                <environment name="uv" load="APM32F407MINI-Blinky.uvprojx"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <category>Getting Started</category>
                <keyword>LED</keyword>
                <keyword>APM32F407</keyword>
            </attributes>
        </example><!--APM32F465 example information--><example name="APM32F465MINI-Blinky" doc="readme.txt" folder="Boards/Geehy/APM32F465MINI/Blinky">
            <description>APM32F465_MINI  Blinky example</description>
            <board name="APM32F465MINI" vendor="Geehy"/>
            <project>
                <environment name="uv" load="APM32F465MINI-Blinky.uvprojx"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <category>Getting Started</category>
                <keyword>LED</keyword>
                <keyword>APM32F465</keyword>
            </attributes>
        </example>
    </examples>
</package>